# <center> This notebook for generate analysis notebook

In [1]:
import sys
sys.path.append('/home/me/work/epsilon_project')

In [2]:
from easviz import generator
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from database.DB import PostgreSQLConnection

In [3]:
con = PostgreSQLConnection(host='172.17.0.2',database='work',user='postgres',password='123')
con.connect()

Connected to the PostgreSQL database

In [4]:
# Define the SQL query to retrieve data from the table
sql_query = "SELECT * FROM job"

# Read the table data into a Pandas DataFrame
df = pd.read_sql(sql_query, con.connection)

# Close the database connection
con.close()

Connection to PostgreSQL closed

/tmp/ipykernel_17117/4280990055.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql_query, con.connection)

In [5]:
df.head()

,id,job_titile,job_location,job_description,company_name,company_size,company_founde,company_type,company_industry,company_sector,company_revenue,stars,min_salary,max_salary
0,3fd3d844120f9a198fa1d7220204c6d8,Junior Data Analyst,Montreal,Cosmetic Physician Partners is building the le...,Cosmetic Physician Partners,NaN,4.3,4.3,,,0,4,49000.0,76000.0
1,3f668f68bbdbea01a19744b7800f9f9e,Data Analyst,Vaughan,Job Title: Data Analyst\nJoin Our Team as a Da...,Novitech Inc.,NaN,,,,Search,0,0,48000.0,NaN
2,8e12e3037980fd899c126b27de220b15,Data Analyst,Richmond,Job Title: Data Analyst\nJoin Our Team as a Da...,Vanbuy Technology Ltd.,NaN,,,,Search,0,0,42.0,47.0
3,ca3d308523cb617c9356a85ba3a002e3,Data Modeler/Data Analyst,"Fairfax, VA","Responsibilities:\n· Designs, implements, and ...",Freddie Mac,NaN,3.5,3.5,,,0,4,70.0,75.0
4,7ce0fdd4b0f0326bec173105a5392f58,Data Analyst,"California, MD",The Organization: Sierra Management and Techno...,"Sierra Management and Technologies, Inc",NaN,4.4,4.4,,,0,4,55000.0,85000.0

In [6]:
df.to_csv('../data/data.csv')

In [7]:
generator.generate(notebook_path='./funhhh.ipynb',dataset_path='../data/data.csv')